gighighway/app/Http/Controllers/CategoriesController.php

select * from `categories` where `slug` = 'event-services' limit 1
---
    public function show($slug)
    {
        $category = Category::where('slug', $slug)
            ->with('children.children.children')
            ->first();