gighighway/app/Http/Controllers/PageController.php

    public function index(){
        $vendors = Vendor::where('featured',true)
            ->select('vendors.*')
            ->averageRating()->reviewCount()
            ->with('reviews', 'images', 'location', 'primaryCategory')->get();

        $testimonials = testimonials::all();
//        dd($testimonials);
        return view('home.index')->with('vendors',$vendors)->with('testimonials',$testimonials);
---
select * from `categories` where `categories`.`id` in ('')
select * from `images` where `images`.`vendor_id` in ('')
select * from `reviews` where `reviews`.`vendor_id` in ('')
select `vendors`.*, AVG(avgRev.rating) as average_rating, SUM(revCount.id) as review_count from `vendors` left join `reviews` as `avgRev` on `avgRev`.`vendor_id` = `vendors`.`id` left join `reviews` as `revCount` on `revCount`.`vendor_id` = `vendors`.`id` where `featured` = '1'
select * from `testimonials`