gighighway/app/Http/Controllers/VendorController.php

    public function show($slug){
        $vendor = Vendor::where('slug', '=', $slug)
            ->with('reviews')
            ->first();
---
select * from `vendors` where `slug` = 'search' limit 1