gighighway/app/Http/Controllers/VisitorController.php

select * from `quote_requests` inner join `vendors` on `quote_requests`.`vendor_id` = `vendors`.`id`
---
    public function index(){
  $user = auth()->user() ?: 0;

  if( $user->quoteRequests()){

	 $openRequests = $user->quoteRequests()->get();
  }else{
	   $openRequests =DB::table('quote_requests')
	   ->join('vendors','quote_requests.vendor_id', '=', 'vendors.id')->get();