gighighway/app/Repositories/VendorRepository.php

    public function createFromRequest(User $user, Request $request)
    {
        $vendor = new Vendor;

        // Minimum requred to create a vendor
        $vendor->name = $request->get('name');
        $vendor->description = $request->get('description');
        $vendor->description_brief = $request->get('description_brief');
        $vendor->website = $request->get('website');
        $vendor->phone = $request->get('phone');
		//$vendor->type = $request->get('type');
        $vendor->featured = false;
        $vendor->has_liability_insurance = 0;

        foreach(['facebook', 'googleplus', 'instagram', 'pinterest', 'twitter', 'vimeo', 'youtube'] as $sm) {
            $key = 'sml_'.$sm;
            $vendor->$key = $request->get($key);
        }

        $vendor->save();

        $user->vendors()->attach($vendor->id);
---
insert into `user_vendor` (`user_id`, `vendor_id`) values ('12', '5')


        $this->updateSubscription($vendor, $request);

        $vendor->save();
---
update `vendors` set `slug` = 'adasd', `updated_at` = '2018-07-31 00:06:03' where `id` = '5'

    protected function updateCategories(Vendor $vendor, Request $request)
    {
        $primaryCategory = $request->get('primary_category');
        $vendor->update(['primary_category_id' => $primaryCategory['id']]);

        $categories = $request->get('categories');
        \DB::table('vendor_categories')->where('vendor_id', '=', $vendor->id)->delete();
        foreach($categories as $cat) {
            $vendor->categories()->attach($cat['id']);
---
update `vendors` set `slug` = 'adasd-2', `location_zip_code` = '00601', `show_phone_number` = '1', `what_to_expect` = '', `technical_information` = '', `setup_requirements` = '', `estimated_event_duration` = '', `estimated_event_duration_time_measurement` = '', `travel_distance_in_miles` = '', `pay_range_min` = '', `pay_range_max` = '', `languages` = '', `primary_category_id` = '2', `updated_at` = '2018-07-31 00:06:03' where `id` = '5'
delete from `vendor_categories` where `vendor_id` = '5'
insert into `vendor_categories` (`category_id`, `vendor_id`) values ('2', '5')