gighighway/app/Vendor.php

    public function getOpenQuoteRequestCountAttribute()
    {
        return $this->quoteRequests()->count();
---
select count(*) as aggregate from `quote_requests` where `quote_requests`.`vendor_id` = '2' and `quote_requests`.`vendor_id` is not null

    public function generateSlug() {
        // Slug is name-category-city-state
        $slugString = $this->name;
        if($this->primaryCategory) {
            $slugString .= ' ' . $this->primaryCategory->name;
        }
        if($this->location) {
            $slugString .= ' ' . $this->location->city . ' ' . $this->location->state;
        }

        return str_slug($slugString);
    }
}

Vendor::saving(function(Vendor $vendor) {
    $slug = $vendor->generateSlug();
    $originalSlug = $slug;
    $i = 2;
    while($count = Vendor::where('slug', '=', $slug)->count()) {
---
select count(*) as aggregate from `vendors` where `slug` = 'adasd'