gighighway/app/Http/Controllers/Api/PublicSearchController.php

    public function typeaheadCategories(Request $request)
    {
        $query = $request->get('q');

        $catQuery = Category::where('name', 'LIKE', "%{$query}%")
            ->select(['id', 'name']);

        if($request->has('excludedIds')) {
            $catQuery->whereNotIn('id', explode(',', $request->get('excludedIds')));
        }

        $categories = $catQuery->limit('25')->get();
---
select `id`, `name` from `categories` where `name` LIKE '%a%' limit 25