gighighway/app/Http/Controllers/Api/VendorsApiController.php

    public function store(Request $request, VendorRepository $repository)
    {
        $user = auth()->user();

        $savedVendor = $repository->createFromRequest($user, $request);

        $vendor = Vendor::where('id', '=', $savedVendor->id)->with($this->withArray)->first();
---
select * from `vendors` where `id` = '5' limit 1

    public function show(BillingService $billingService, $id)
    {
        $vendor = Vendor::where('vendors.id', '=', $id)
            ->with($this->withArray)
            ->first();
---
select * from `vendors` where `vendors`.`id` = '2' limit 1