gighighway/app/ViewComposers/AuthenticatedViewComposer.php

    public function compose(View $view)
    {
        $vendor = $this->currentVendorProfileService->get();
        $view->with('user', auth()->user());
        $view->with('currentVendor', $vendor);
        $view->with('reviewCount', $vendor->reviews()->count());
---
select count(*) as aggregate from `reviews` where `reviews`.`vendor_id` = '2' and `reviews`.`vendor_id` is not null