gighighway/app/Services/CurrentVendorProfileService.php

select `vendors`.*, `user_vendor`.`user_id` as `pivot_user_id`, `user_vendor`.`vendor_id` as `pivot_vendor_id` from `vendors` inner join `user_vendor` on `vendors`.`id` = `user_vendor`.`vendor_id` where `user_vendor`.`user_id` = '5' and `vendors`.`id` = '2' limit 1
select `vendors`.*, `user_vendor`.`user_id` as `pivot_user_id`, `user_vendor`.`vendor_id` as `pivot_vendor_id` from `vendors` inner join `user_vendor` on `vendors`.`id` = `user_vendor`.`vendor_id` where `user_vendor`.`user_id` = '1' limit 1
---
    public function get()
    {
        $user = auth()->user();
        if(!$user) return null;

        if($user->current_vendor_id) {
            return $user->vendors()->where('vendors.id', '=', $user->current_vendor_id)->first();
        }

        $vendor = $user->vendors()->first();